#!/usr/bin/env python3.5
# -*- coding: utf-8 -*-
# Author: ChenLiang

"""
三级菜单
可依次选择进入各子菜单
所需新知识点：列表、字典
"""

_map = {"北京地区": {"北京市区": ["东城区", "西城区", "朝阳区", "海淀区", "石景山区", "丰台区"], "北京郊区": ["昌平区", "顺义区", "通州区", "大兴区"]},
            "四川地区": {"成都市区": ["锦江区", "青羊区", "金牛区", "武侯区", "成华区", "高新区", "龙泉驿区", "温江区"]},
            "广东地区": {"深圳市区": ["福田区", "罗湖区", "南山区", "盐田区", "宝安区", "龙岗区"]},
            "上海地区": {"上海市区": ["黄浦区", "徐汇区", "长宁区", "静安区", "普陀区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东区"]}
        }
msg = """
--------------------------------------------
++++++++++++++++++++++++++++++++++++++++++++
      +++++欢迎来到热门地区查询系统+++++
++++++++++++++++++++++++++++++++++++++++++++
--------------------------------------------
           +++++地区信息概况+++++
-----------------地区首级列表-----------------
"""
print(msg)
for key in _map:  # 遍历字典的key，列出第一层地区信息
    print(key)
print("--------------------------------------------")
flag = False  # 用于跳出外循环
for i in range(3):  # 外循环，指定循环3次，3次外循环完了，就退出程序
    input_city = input("请输入你要查看的地区名字: ")
    if input_city in _map:  # 检查输入的地区是否在地图中，如果地区名字3次输入错误，程序退出
        city_name = _map[input_city]
        area_name = city_name.keys()  # 使用输入的信息作为key，取出城市信息，存在字典中
        while True:  # 内循环，死循环，不指定循环次数，通过break或者flag跳出
            print("-----------------地区二级列表-----------------")  # 分隔线
            for i in area_name:  # 遍历列表，取出城市名字，打印出来
                print(i)
            print("--------------------------------------------")
            area_input = input("请输入你要查看的片区名字: ")
            if area_input in area_name:  # 判断输入的片区名字是否在地区列表中
                area_select = _map[input_city][area_input]  # 取出省中有哪些市，存在列表中
                print("-----------------地区三级列表-----------------")  # 分隔线
                for i in area_select:  # 遍历列表，取出地区市名字，打印出来
                    print(i)
                print("--------------------------------------------")
            if area_input not in area_name:  # 如果输入的地区名字不在在地区列表中
                print("输入的地区名字不对，请重新输入")
                continue  # 跳出当次迭代，开始下一次迭代循环，直到地市名字输入正确为止(不停的要求输入)
            _ctrl = input("请问是否退出？按b返回上一级菜单;按q退出整个程序")
            # 显示完地区市后，就要退出程序了，一个是全部退出，一个是返回上一级菜单
            if _ctrl == "q":
                flag = True  # 用于跳出外循环
                break  # 跳出while内循环
            if _ctrl == "b":
                continue  # 跳出当次迭代，开始下一次迭代循环,重新输入省处，返回上一步
            print("你输入的信息有误，请重新输入...")
        if flag:  # 跳出外循环的条件满足
            break  # 跳出外循环
else:  # 上面的3次for循环正常执行完毕，else才会执行，如果是不正常退出（break），else不会执行
    print("3次输入错误，程序退出!")
